# language: ru
Функция: стандартные типы данныз

  Сценарий:
    * передадим в метод шага целое число 15
    * передадим в метод шага "текст"
    * передадим в метод шага hello

    * альтернативный текст
    * основной текст

    * передадим в метод коллекцию строк
      | строка 1 |
      | строка 2 |
      | строка 3 |

    * передадим в метод коллекцию bigdecimal
      | 1.54 |
      | 2.1  |
      | 3.3  |
    * передадим в метод ассоциативный массив
      | ключ 1 | значение 1 |
      | ключ 2 | значение 2 |
      | ключ 3 | значение 3 |

    * передадим в метод datatable
      | ключ 1 | значение 1 | значение 4 |
      | ключ 2 | значение 2 | значение 5 |
      | ключ 3 | значение 3 | значение 6 |